backend/yogioh/app/controllers/cards_controller.rb

INSERT INTO "cards" ("title", "pic_sm", "pic_lg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ttiel"], ["pic_sm", "smpic"], ["pic_lg", "lgpic"], ["created_at", "2020-10-13 19:15:00.551225"], ["updated_at", "2020-10-13 19:15:00.551225"]]
---
  def create
    @card = Card.new(card_params)

    if @card.save

UPDATE "cards" SET "title" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["title", "Tornado Dragon"], ["updated_at", "2020-10-14 02:46:05.403281"], ["id", 8]]
---
  def update
    if @card.update(card_params)